-------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/nyoumssiboss/Desktop/E_P/P1_LOG.log
  log type:  text
 opened on:  11 Nov 2022, 03:18:45

. do "/var/folders/dc/4chl20793rvf6j8szcwskp840000gn/T//SD20098.000000"

. import delimited "/Users/nyoumssiboss/Desktop/E_P/FULLDATA_1.csv", varnames(1) case(upper) 
(encoding automatically selected: UTF-8)
(7 vars, 16,492 obs)

. 
. label variable YEAR "Year from 1960 t0 2021"

. 
. tab YEAR

  Year from |
    1960 t0 |
       2021 |      Freq.     Percent        Cum.
------------+-----------------------------------
       1960 |        266        1.61        1.61
       1961 |        266        1.61        3.23
       1962 |        266        1.61        4.84
       1963 |        266        1.61        6.45
       1964 |        266        1.61        8.06
       1965 |        266        1.61        9.68
       1966 |        266        1.61       11.29
       1967 |        266        1.61       12.90
       1968 |        266        1.61       14.52
       1969 |        266        1.61       16.13
       1970 |        266        1.61       17.74
       1971 |        266        1.61       19.35
       1972 |        266        1.61       20.97
       1973 |        266        1.61       22.58
       1974 |        266        1.61       24.19
       1975 |        266        1.61       25.81
       1976 |        266        1.61       27.42
       1977 |        266        1.61       29.03
       1978 |        266        1.61       30.65
       1979 |        266        1.61       32.26
       1980 |        266        1.61       33.87
       1981 |        266        1.61       35.48
       1982 |        266        1.61       37.10
       1983 |        266        1.61       38.71
       1984 |        266        1.61       40.32
       1985 |        266        1.61       41.94
       1986 |        266        1.61       43.55
       1987 |        266        1.61       45.16
       1988 |        266        1.61       46.77
       1989 |        266        1.61       48.39
       1990 |        266        1.61       50.00
       1991 |        266        1.61       51.61
       1992 |        266        1.61       53.23
       1993 |        266        1.61       54.84
       1994 |        266        1.61       56.45
       1995 |        266        1.61       58.06
       1996 |        266        1.61       59.68
       1997 |        266        1.61       61.29
       1998 |        266        1.61       62.90
       1999 |        266        1.61       64.52
       2000 |        266        1.61       66.13
       2001 |        266        1.61       67.74
       2002 |        266        1.61       69.35
       2003 |        266        1.61       70.97
       2004 |        266        1.61       72.58
       2005 |        266        1.61       74.19
       2006 |        266        1.61       75.81
       2007 |        266        1.61       77.42
       2008 |        266        1.61       79.03
       2009 |        266        1.61       80.65
       2010 |        266        1.61       82.26
       2011 |        266        1.61       83.87
       2012 |        266        1.61       85.48
       2013 |        266        1.61       87.10
       2014 |        266        1.61       88.71
       2015 |        266        1.61       90.32
       2016 |        266        1.61       91.94
       2017 |        266        1.61       93.55
       2018 |        266        1.61       95.16
       2019 |        266        1.61       96.77
       2020 |        266        1.61       98.39
       2021 |        266        1.61      100.00
------------+-----------------------------------
      Total |     16,492      100.00

. 
. sum GDPPERCAPITACURRENTUS CURRENTHEALTHEXPENDITUREOFGDP GOVERNMENTEXPENDITUREONEDUCATION LIFEEXPECTAN
> CYATBIRTHTOTALYEARS POPULATIONGROWTHANNUAL

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
GDPPERCAPI~S |     13,115    8106.761    16196.89   12.80281   189487.1
CURRENTHEA~P |      4,694     6.15872    2.738623   1.263576   24.24389
GOVERNMENT~N |      5,584    4.324658    1.923002     .62247   44.33398
LIFEEXPECT~S |     14,858    64.03066    11.22824     18.907    85.3878
POPULATION~L |     16,118     1.77112    1.562222  -10.95515   28.04103

. 
. summarize GDPPERCAPITACURRENTUS CURRENTHEALTHEXPENDITUREOFGDP GOVERNMENTEXPENDITUREONEDUCATION LIFEEX
> PECTANCYATBIRTHTOTALYEARS POPULATIONGROWTHANNUAL

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
GDPPERCAPI~S |     13,115    8106.761    16196.89   12.80281   189487.1
CURRENTHEA~P |      4,694     6.15872    2.738623   1.263576   24.24389
GOVERNMENT~N |      5,584    4.324658    1.923002     .62247   44.33398
LIFEEXPECT~S |     14,858    64.03066    11.22824     18.907    85.3878
POPULATION~L |     16,118     1.77112    1.562222  -10.95515   28.04103

.  
. misstable summarize GDPPERCAPITACURRENTUS CURRENTHEALTHEXPENDITUREOFGDP GOVERNMENTEXPENDITUREONEDUCAT
> ION LIFEEXPECTANCYATBIRTHTOTALYEARS POPULATIONGROWTHANNUAL 
                                                               Obs<.
                                                +------------------------------
               |                                | Unique
      Variable |     Obs=.     Obs>.     Obs<.  | values        Min         Max
  -------------+--------------------------------+------------------------------
  GDPPERCAPI~S |     3,377              13,115  |   >500   12.80281    189487.1
  CURRENTHEA~P |    11,798               4,694  |   >500   1.263576    24.24389
  GOVERNMENT~N |    10,908               5,584  |   >500     .62247    44.33398
  LIFEEXPECT~S |     1,634              14,858  |   >500     18.907     85.3878
  POPULATION~L |       374              16,118  |   >500  -10.95515    28.04103
  -----------------------------------------------------------------------------

.  
. codebook  GDPPERCAPITACURRENTUS CURRENTHEALTHEXPENDITUREOFGDP GOVERNMENTEXPENDITUREONEDUCATION LIFEEX
> PECTANCYATBIRTHTOTALYEARS POPULATIONGROWTHANNUAL

-------------------------------------------------------------------------------------------------------
GDPPERCAPITACURRENTUS                                                      GDP per capita (current US$)
-------------------------------------------------------------------------------------------------------

                  Type: Numeric (float)

                 Range: [12.802813,189487.14]         Units: 1.000e-06
         Unique values: 12,990                    Missing .: 3,377/16,492

                  Mean: 8106.76
             Std. dev.: 16196.9

           Percentiles:     10%       25%       50%       75%       90%
                        231.255   546.112   1852.39   7558.37     24271

-------------------------------------------------------------------------------------------------------
CURRENTHEALTHEXPENDITUREOFGDP                                     Current health expenditure (% of GDP)
-------------------------------------------------------------------------------------------------------

                  Type: Numeric (float)

                 Range: [1.263576,24.243891]          Units: 1.000e-07
         Unique values: 4,624                     Missing .: 11,798/16,492

                  Mean: 6.15872
             Std. dev.: 2.73862

           Percentiles:     10%       25%       50%       75%       90%
                         3.2798   4.26492   5.45572   7.70944     9.737

-------------------------------------------------------------------------------------------------------
GOVERNMENTEXPENDITUREONEDUCATION                  Government expenditure on education, total (% of GDP)
-------------------------------------------------------------------------------------------------------

                  Type: Numeric (float)

                 Range: [.62247,44.333981]            Units: 1.000e-07
         Unique values: 4,866                     Missing .: 10,908/16,492

                  Mean: 4.32466
             Std. dev.:   1.923

           Percentiles:     10%       25%       50%       75%       90%
                          2.291   3.10783   4.11708   5.18769   6.37312

-------------------------------------------------------------------------------------------------------
LIFEEXPECTANCYATBIRTHTOTALYEARS                                 Life expectancy at birth, total (years)
-------------------------------------------------------------------------------------------------------

                  Type: Numeric (float)

                 Range: [18.907,85.387802]            Units: 1.000e-06
         Unique values: 13,517                    Missing .: 1,634/16,492

                  Mean: 64.0307
             Std. dev.: 11.2282

           Percentiles:     10%       25%       50%       75%       90%
                         47.312   55.9606    66.817    72.534   76.8091

-------------------------------------------------------------------------------------------------------
POPULATIONGROWTHANNUAL                                                     Population growth (annual %)
-------------------------------------------------------------------------------------------------------

                  Type: Numeric (float)

                 Range: [-10.95515,28.041031]         Units: 1.000e-09
         Unique values: 15,961                    Missing .: 374/16,492

                  Mean: 1.77112
             Std. dev.: 1.56222

           Percentiles:     10%       25%       50%       75%       90%
                        .163396   .763366   1.73345   2.62914    3.1471

. 
. tab YEAR, sum(GDPPERCAPITACURRENTUS) 

  Year from | Summary of GDP per capita (current
    1960 t0 |                US$)
       2021 |        Mean   Std. dev.       Freq.
------------+------------------------------------
       1960 |   477.11651   614.51874         133
       1961 |   490.05618   637.22717         135
       1962 |   513.86732   668.45015         137
       1963 |   545.38092   707.89647         137
       1964 |   591.67434   774.23833         137
       1965 |   655.68403   863.40787         148
       1966 |   711.22173   934.38593         151
       1967 |   722.99313   963.44412         155
       1968 |   739.82829    991.9867         160
       1969 |   801.22702   1068.2717         160
       1970 |    964.3694   1472.1471         169
       1971 |    1067.874   1627.5809         172
       1972 |   1234.0255   1921.6176         172
       1973 |   1541.6233   2411.8341         172
       1974 |   1954.8266   2997.8635         173
       1975 |   2285.8278   3827.3106         175
       1976 |   2470.5487   4164.4971         176
       1977 |   2707.2218    4550.468         179
       1978 |   3067.5892   4979.4109         178
       1979 |   3650.4415   5975.6824         179
       1980 |   4190.1602   6967.1389         191
       1981 |   4031.0464   6533.0166         194
       1982 |   3851.1115   5970.3677         195
       1983 |   3674.4223   5539.1123         196
       1984 |   3619.7303   5383.8177         197
       1985 |   3604.9824   5374.4924         199
       1986 |   4162.9812   6501.9883         201
       1987 |   4750.6013   7769.7979         205
       1988 |   5096.8676   8411.8254         210
       1989 |   5232.6845    8529.957         210
       1990 |   5768.7693   9853.4478         226
       1991 |   5836.5502    10023.61         226
       1992 |   6144.8033   10761.598         226
       1993 |   5924.9684   10263.904         228
       1994 |   6252.8967   10974.819         230
       1995 |   7076.0272   12414.918         240
       1996 |   7297.7647   12574.201         240
       1997 |   7179.6968   11837.227         240
       1998 |   7401.2834   12257.932         242
       1999 |    7718.458   12753.094         243
       2000 |   7648.5314   12296.573         247
       2001 |   7601.3317   12261.832         248
       2002 |   8190.8687   13123.838         253
       2003 |   9396.5463   15193.862         253
       2004 |   10697.553   17193.161         253
       2005 |   11565.078   18104.862         253
       2006 |    12904.73   20127.604         254
       2007 |   14700.051   23116.298         254
       2008 |   15761.241   24600.549         255
       2009 |   14068.597   21574.905         255
       2010 |   14756.554   22142.039         256
       2011 |    16240.11   24197.134         259
       2012 |   16146.249   23548.704         257
       2013 |   16682.656   25086.565         258
       2014 |   17011.003   25722.011         259
       2015 |   15399.102   23227.289         258
       2016 |   15570.979   23470.408         257
       2017 |   16376.274   24288.601         257
       2018 |   17333.253   25857.524         257
       2019 |   17224.749   25656.133         255
       2020 |   15162.607   22146.534         251
       2021 |   15118.045   21696.748         229
------------+------------------------------------
      Total |   8106.7615   16196.887      13,115

. 
. scatter  LIFEEXPECTANCYATBIRTHTOTALYEARS GDPPERCAPITACURRENTUS

. 
. corr LIFEEXPECTANCYATBIRTHTOTALYEARS GDPPERCAPITACURRENTUS CURRENTHEALTHEXPENDITUREOFGDP GOVERNMENTEX
> PENDITUREONEDUCATION LIFEEXPECTANCYATBIRTHTOTALYEARS POPULATIONGROWTHANNUAL
(obs=3,324)

             | LIFEEX~S GDPPER~S CURREN~P GOVERN~N LIFEEX~S POPULA~L
-------------+------------------------------------------------------
LIFEEXPECT~S |   1.0000
GDPPERCAPI~S |   0.6158   1.0000
CURRENTHEA~P |   0.3727   0.4638   1.0000
GOVERNMENT~N |   0.2550   0.2422   0.3611   1.0000
LIFEEXPECT~S |   1.0000   0.6158   0.3727   0.2550   1.0000
POPULATION~L |  -0.4398  -0.1361  -0.3111  -0.2101  -0.4398   1.0000


. //Correlation lower than 0.8 so we are certainly eveading the problem of perfect collinearity in our 
> regression
. 
.  
. eststo clear

. 
. reg LIFEEXPECTANCYATBIRTHTOTALYEARS GDPPERCAPITACURRENTUS

      Source |       SS           df       MS      Number of obs   =    12,371
-------------+----------------------------------   F(1, 12369)     =   4936.71
       Model |  430261.068         1  430261.068   Prob > F        =    0.0000
    Residual |  1078025.54    12,369  87.1554322   R-squared       =    0.2853
-------------+----------------------------------   Adj R-squared   =    0.2852
       Total |  1508286.61    12,370  121.931011   Root MSE        =    9.3357

---------------------------------------------------------------------------------------
LIFEEXPECTANCYATBIR~S | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
----------------------+----------------------------------------------------------------
GDPPERCAPITACURRENTUS |   .0004132   5.88e-06    70.26   0.000     .0004017    .0004247
                _cons |   61.68161   .0941717   654.99   0.000     61.49702     61.8662
---------------------------------------------------------------------------------------

. eststo ols

. 
. // GDP per capita has a 0.4% impact on Life expecatncy at birth which is significant at the 5% level 
> but the regresssion only explains about 28.53 percent of the total variability which is 
. // not that good
. 
. 
. gen LOG_GDPPERCAPITACURRENTUS = log(GDPPERCAPITACURRENTUS)
(3,377 missing values generated)

. 
. reg LIFEEXPECTANCYATBIRTHTOTALYEARS LOG_GDPPERCAPITACURRENTUS

      Source |       SS           df       MS      Number of obs   =    12,371
-------------+----------------------------------   F(1, 12369)     =  31779.76
       Model |  1085715.32         1  1085715.32   Prob > F        =    0.0000
    Residual |  422571.287    12,369   34.163739   R-squared       =    0.7198
-------------+----------------------------------   Adj R-squared   =    0.7198
       Total |  1508286.61    12,370  121.931011   Root MSE        =     5.845

-------------------------------------------------------------------------------------------
LIFEEXPECTANCYATBIRTHTO~S | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
--------------------------+----------------------------------------------------------------
LOG_GDPPERCAPITACURRENTUS |   5.516965   .0309475   178.27   0.000     5.456303    5.577627
                    _cons |   23.02634   .2395023    96.14   0.000     22.55688    23.49581
-------------------------------------------------------------------------------------------

. eststo ols2

. 
. // LOG_GDPPERCAPITACURRENTUS has a positive impact on life expectancy of about 5.51 which is signific
> ant at 5% level , more importantly the regression explains about 72% of the total variability which i
> s good and the standard error is very low at about 0.0309475
. 
. reg LIFEEXPECTANCYATBIRTHTOTALYEARS LOG_GDPPERCAPITACURRENTUS CURRENTHEALTHEXPENDITUREOFGDP GOVERNMEN
> TEXPENDITUREONEDUCATION POPULATIONGROWTHANNUAL

      Source |       SS           df       MS      Number of obs   =     3,324
-------------+----------------------------------   F(4, 3319)      =   1956.15
       Model |  175549.954         4  43887.4885   Prob > F        =    0.0000
    Residual |  74464.0355     3,319  22.4356841   R-squared       =    0.7022
-------------+----------------------------------   Adj R-squared   =    0.7018
       Total |   250013.99     3,323  75.2374329   Root MSE        =    4.7366

--------------------------------------------------------------------------------------------------
 LIFEEXPECTANCYATBIRTHTOTALYEARS | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------------------+----------------------------------------------------------------
       LOG_GDPPERCAPITACURRENTUS |   4.551129   .0650973    69.91   0.000     4.423494    4.678764
   CURRENTHEALTHEXPENDITUREOFGDP |  -.0066362    .039584    -0.17   0.867    -.0842476    .0709752
GOVERNMENTEXPENDITUREONEDUCATION |  -.0209967   .0534001    -0.39   0.694    -.1256971    .0837037
          POPULATIONGROWTHANNUAL |  -1.118882   .0693415   -16.14   0.000    -1.254838   -.9829252
                           _cons |    33.4306   .5651351    59.16   0.000     32.32256    34.53865
--------------------------------------------------------------------------------------------------

. eststo ols3

. 
. //  Population growth has a significant negative impact in my model on life expectancy at the 5% leve
> l of about -1.12, R squared is high at about 70% which is good , health expenditure and education exp
> enditure botaffect life expectatncy negatively in my model and they are not significant at the 5% nor
>  the 10% level
. 
. describe COUNTRY

Variable      Storage   Display    Value
    name         type    format    label      Variable label
-------------------------------------------------------------------------------------------------------
COUNTRY         str52   %52s                  

. encode COUNTRY, generate(COUNTRY_I) 

. label variable COUNTRY_I "Countries with numbers as underlying to serve in regression"

. reg LIFEEXPECTANCYATBIRTHTOTALYEARS LOG_GDPPERCAPITACURRENTUS CURRENTHEALTHEXPENDITUREOFGDP GOVERNMEN
> TEXPENDITUREONEDUCATION POPULATIONGROWTHANNUAL i.COUNTRY_I 

      Source |       SS           df       MS      Number of obs   =     3,324
-------------+----------------------------------   F(227, 3096)    =    386.52
       Model |   241492.76       227  1063.84476   Prob > F        =    0.0000
    Residual |   8521.2294     3,096  2.75233508   R-squared       =    0.9659
-------------+----------------------------------   Adj R-squared   =    0.9634
       Total |   250013.99     3,323  75.2374329   Root MSE        =     1.659

------------------------------------------------------------------------------------------------------
     LIFEEXPECTANCYATBIRTHTOTALYEARS | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------------------------------+----------------------------------------------------------------
           LOG_GDPPERCAPITACURRENTUS |   3.939137   .0724841    54.34   0.000     3.797016    4.081259
       CURRENTHEALTHEXPENDITUREOFGDP |   .1560083   .0365897     4.26   0.000     .0842657    .2277509
    GOVERNMENTEXPENDITUREONEDUCATION |   .1904143   .0404678     4.71   0.000     .1110679    .2697608
              POPULATIONGROWTHANNUAL |   -.270983   .0557221    -4.86   0.000     -.380239    -.161727
                                     |
                           COUNTRY_I |
        Africa Eastern and Southern  |  -7.140804   .6157179   -11.60   0.000     -8.34806   -5.933547
         Africa Western and Central  |  -11.14268   .6260282   -17.80   0.000    -12.37015   -9.915206
                            Albania  |   6.999552    .677991    10.32   0.000     5.670194    8.328909
                            Algeria  |   5.041834   .7848332     6.42   0.000     3.502988    6.580681
                             Angola  |  -11.54914   .6811367   -16.96   0.000    -12.88467   -10.21362
                Antigua and Barbuda  |   1.292557   .8848054     1.46   0.144     -.442308    3.027422
                         Arab World  |  -.6075686   .7941159    -0.77   0.444    -2.164616    .9494787
                          Argentina  |   1.405012    .623995     2.25   0.024     .1815261    2.628498
                            Armenia  |   4.736332   .6172458     7.67   0.000     3.526079    5.946584
                          Australia  |   1.135926   .7103854     1.60   0.110    -.2569489      2.5288
                            Austria  |  -.2479123   .6799171    -0.36   0.715    -1.581047    1.085222
                         Azerbaijan  |   1.841011   .6659512     2.76   0.006     .5352601    3.146762
                       Bahamas, The  |  -5.109126   .7288882    -7.01   0.000    -6.538279   -3.679972
                            Bahrain  |   .8289803   .7266129     1.14   0.254    -.5957119    2.253672
                         Bangladesh  |   6.537286   .6921115     9.45   0.000     5.180241     7.89433
                           Barbados  |   2.265385   .6825944     3.32   0.001     .9270009    3.603768
                            Belarus  |  -.0483297   .6871258    -0.07   0.944    -1.395598    1.298939
                            Belgium  |  -.3697772   .7563168    -0.49   0.625    -1.852711    1.113156
                             Belize  |   1.629853   .6845681     2.38   0.017     .2875995    2.972106
                              Benin  |  -4.568701   .6353837    -7.19   0.000    -5.814517   -3.322885
                             Bhutan  |   .5814378   .6879044     0.85   0.398    -.7673573    1.930233
                            Bolivia  |   .2013093   .7690383     0.26   0.794    -1.306568    1.709186
                           Botswana  |  -9.075296    .806117   -11.26   0.000    -10.65587   -7.494718
                             Brazil  |  -.0337507    .637381    -0.05   0.958    -1.283483    1.215982
                  Brunei Darussalam  |  -3.225497    .937874    -3.44   0.001    -5.064415   -1.386579
                           Bulgaria  |   1.467957   .6974717     2.10   0.035     .1004033    2.835511
                       Burkina Faso  |   -4.51058   .6761502    -6.67   0.000    -5.836328   -3.184832
                            Burundi  |   -1.80018   .6005433    -3.00   0.003    -2.977684   -.6226767
                         Cabo Verde  |   2.182317   .6810966     3.20   0.001     .8468695    3.517763
                           Cambodia  |   2.411729   .6296281     3.83   0.000     1.177198     3.64626
                           Cameroon  |  -9.533371   .6299634   -15.13   0.000    -10.76856   -8.298183
                             Canada  |   .6557047   .7812389     0.84   0.401    -.8760942    2.187504
             Caribbean small states  |  -.7087922   .6708891    -1.06   0.291    -2.024225    .6066405
           Central African Republic  |  -12.62046   .6128488   -20.59   0.000    -13.82209   -11.41883
     Central Europe and the Baltics  |   .5821023   .6745658     0.86   0.388    -.7405395    1.904744
                               Chad  |  -10.49534   .6439344   -16.30   0.000    -11.75792   -9.232759
                              Chile  |   4.375366   .6568336     6.66   0.000     3.087492     5.66324
                              China  |   3.852858   .6943607     5.55   0.000     2.491404    5.214312
                           Colombia  |   4.172361   .6240606     6.69   0.000     2.948746    5.395975
                            Comoros  |  -2.952566    .789659    -3.74   0.000    -4.500875   -1.404258
                   Congo, Dem. Rep.  |   -1.47349   .8348463    -1.76   0.078    -3.110399    .1634181
                        Congo, Rep.  |  -6.537897   .7178221    -9.11   0.000    -7.945353   -5.130442
                         Costa Rica  |   5.583783   .6416687     8.70   0.000     4.325644    6.841922
                      Cote d'Ivoire  |  -12.90182   .6208445   -20.78   0.000    -14.11913   -11.68451
                            Croatia  |   1.023286   .7449333     1.37   0.170    -.4373279    2.483899
                               Cuba  |   5.549037   .7589308     7.31   0.000     4.060978    7.037095
                             Cyprus  |   1.451021   .7034375     2.06   0.039     .0717695    2.830272
                            Czechia  |   1.181247   .6745323     1.75   0.080    -.1413292    2.503823
                            Denmark  |  -3.024349   .7186418    -4.21   0.000    -4.433412   -1.615286
                           Djibouti  |  -5.464649   .7165083    -7.63   0.000    -6.869529   -4.059769
                 Dominican Republic  |   1.153001   .6961444     1.66   0.098    -.2119503    2.517953
         Early-demographic dividend  |  -.2475716   .6339077    -0.39   0.696    -1.490494    .9953505
                East Asia & Pacific  |   1.418383   .6555246     2.16   0.031     .1330759     2.70369
East Asia & Pacific (IDA & IBRD ..)  |   3.567455   .6711457     5.32   0.000     2.251519    4.883391
East Asia & Pacific (excluding h..)  |   3.567368   .6709356     5.32   0.000     2.251845    4.882892
                            Ecuador  |   4.459691    .692932     6.44   0.000     3.101038    5.818344
                   Egypt, Arab Rep.  |   2.932803   .6702474     4.38   0.000     1.618629    4.246978
                        El Salvador  |   1.709976   .6245958     2.74   0.006     .4853124     2.93464
                            Eritrea  |  -2.446237   .9444659    -2.59   0.010     -4.29808   -.5943934
                            Estonia  |   -.754605   .6957228    -1.08   0.278     -2.11873    .6095198
                           Eswatini  |  -20.51783   .6437728   -31.87   0.000     -21.7801   -19.25557
                           Ethiopia  |   .7253554   .6409948     1.13   0.258    -.5314627    1.982174
                          Euro area  |   .8395176   .6748196     1.24   0.214    -.4836217    2.162657
              Europe & Central Asia  |  -1.960689    .663692    -2.95   0.003    -3.262011   -.6593683
Europe & Central Asia (IDA & IBR..)  |  -.9030441   .6578601    -1.37   0.170     -2.19293    .3868422
Europe & Central Asia (excluding..)  |  -1.178197   .6564266    -1.79   0.073    -2.465273    .1088785
                     European Union  |   .3011785   .6731179     0.45   0.655    -1.018624    1.620981
                               Fiji  |  -3.571587   .6839402    -5.22   0.000     -4.91261   -2.230565
                            Finland  |  -.6932486   .6946745    -1.00   0.318    -2.055318    .6688209
Fragile and conflict affected sit..  |  -5.884145   .7455594    -7.89   0.000    -7.345986   -4.422304
                             France  |   1.975601   1.299658     1.52   0.129    -.5726786     4.52388
                              Gabon  |  -7.931132   .7592021   -10.45   0.000    -9.419723   -6.442541
                        Gambia, The  |  -2.814747   .6019664    -4.68   0.000    -3.995041   -1.634453
                            Georgia  |   2.676967   .6260813     4.28   0.000      1.44939    3.904543
                            Germany  |   -.522439   .7296936    -0.72   0.474    -1.953171    .9082934
                              Ghana  |  -4.129742    .661115    -6.25   0.000     -5.42601   -2.833474
                             Greece  |   3.075963   .7772741     3.96   0.000     1.551938    4.599988
                            Grenada  |  -.6258033    1.00014    -0.63   0.532    -2.586808    1.335201
                          Guatemala  |   3.091829   .6756583     4.58   0.000     1.767045    4.416613
                             Guinea  |  -5.374252    .624571    -8.60   0.000    -6.598867   -4.149637
                      Guinea-Bissau  |   -6.03257   .6881094    -8.77   0.000    -7.381767   -4.683373
                             Guyana  |  -1.284109   .6835017    -1.88   0.060    -2.624272    .0560537
                              Haiti  |  -2.501849   .8954392    -2.79   0.005    -4.257563   -.7461336
Heavily indebted poor countries ..)  |  -4.156349    .616867    -6.74   0.000    -5.365859   -2.946839
                        High income  |  -.6474329   .6672912    -0.97   0.332    -1.955811    .6609452
                           Honduras  |   5.925274    .729372     8.12   0.000     4.495172    7.355376
                            Hungary  |  -1.046088   .6681626    -1.57   0.118    -2.356175    .2639992
                          IBRD only  |   1.246969   .6369024     1.96   0.050    -.0018254    2.495763
                   IDA & IBRD total  |  -.2848813    .630421    -0.45   0.651    -1.520967    .9512044
                          IDA blend  |  -5.792656   .7046919    -8.22   0.000    -7.174367   -4.410945
                           IDA only  |  -1.802566   .6198512    -2.91   0.004    -3.017927   -.5872045
                          IDA total  |  -3.237224    .633529    -5.11   0.000    -4.479403   -1.995044
                            Iceland  |   .6142781   .6969071     0.88   0.378    -.7521689    1.980725
                              India  |   1.850807   .6738157     2.75   0.006      .529636    3.171978
                          Indonesia  |   1.780611   .6743711     2.64   0.008     .4583513    3.102871
                 Iran, Islamic Rep.  |   3.199833   .6259185     5.11   0.000     1.972576    4.427091
                               Iraq  |    .054326   1.293989     0.04   0.967    -2.482838     2.59149
                            Ireland  |  -.7041215   .6873975    -1.02   0.306    -2.051923    .6436796
                             Israel  |   2.864871   .6770151     4.23   0.000     1.537426    4.192315
                              Italy  |   2.633574   .6802785     3.87   0.000     1.299731    3.967417
                            Jamaica  |   3.134791   .6584872     4.76   0.000     1.843675    4.425907
                              Japan  |    2.77353   .7010455     3.96   0.000     1.398969    4.148091
                             Jordan  |   4.323127   .6358715     6.80   0.000     3.076354    5.569899
                         Kazakhstan  |  -2.549987   .6911943    -3.69   0.000    -3.905233   -1.194741
                              Kenya  |  -4.540536   .6315262    -7.19   0.000    -5.778789   -3.302283
                           Kiribati  |  -1.589465   .7473007    -2.13   0.034    -3.054721     -.12421
                        Korea, Rep.  |   3.548438   .9385893     3.78   0.000     1.708117    5.388759
                             Kuwait  |  -3.323688   .7346959    -4.52   0.000    -4.764229   -1.883148
                    Kyrgyz Republic  |    5.43905   .6037668     9.01   0.000     4.255227    6.622874
                            Lao PDR  |   .0016031   .6597559     0.00   0.998       -1.292    1.295207
          Late-demographic dividend  |   2.713063   .6483223     4.18   0.000     1.441877    3.984248
          Latin America & Caribbean  |   1.170468   .6356412     1.84   0.066    -.0758534    2.416789
Latin America & Caribbean (exclu..)  |   1.219922   .6342919     1.92   0.055    -.0237538    2.463597
Latin America & the Caribbean (I..)  |   1.156379   .6349861     1.82   0.069     -.088658    2.401415
                             Latvia  |  -1.923031   .7053526    -2.73   0.006    -3.306038   -.5400247
Least developed countries: UN cla..  |   -1.53464   .6277247    -2.44   0.015    -2.765439   -.3038408
                            Lebanon  |   6.258004    .623237    10.04   0.000     5.036005    7.480004
                            Lesotho  |  -18.10136   .6651024   -27.22   0.000    -19.40545   -16.79728
                            Liberia  |  -.9818194   .7034106    -1.40   0.163    -2.361018    .3973792
                          Lithuania  |  -1.945546   .7013609    -2.77   0.006    -3.320726   -.5703661
                Low & middle income  |  -.1927481   .6302295    -0.31   0.760    -1.428458    1.042962
                         Low income  |  -3.280888   .6320293    -5.19   0.000    -4.520127   -2.041649
                Lower middle income  |   .4109324   .6379943     0.64   0.520    -.8400026    1.661867
                         Luxembourg  |   -1.11568   .9250773    -1.21   0.228    -2.929507    .6981475
                         Madagascar  |   2.576721   .6044814     4.26   0.000     1.391496    3.761946
                             Malawi  |   -3.47053   .6513437    -5.33   0.000    -4.747639    -2.19342
                           Malaysia  |   1.940787   .6897782     2.81   0.005     .5883175    3.293256
                           Maldives  |    3.87548   .6183446     6.27   0.000     2.663073    5.087887
                               Mali  |  -7.441354   .6206089   -11.99   0.000    -8.658201   -6.224508
                              Malta  |   3.293005   .7107668     4.63   0.000     1.899383    4.686627
                         Mauritania  |  -1.798018   .7339523    -2.45   0.014    -3.237101   -.3589352
                          Mauritius  |   .6418976   .6743194     0.95   0.341    -.6802611    1.964056
                             Mexico  |    1.59598   .6597259     2.42   0.016     .3024351    2.889524
              Micronesia, Fed. Sts.  |  -4.342973   .9221663    -4.71   0.000    -6.151093   -2.534854
         Middle East & North Africa  |   .6839042   .6759408     1.01   0.312    -.6414336    2.009242
Middle East & North Africa (IDA ..)  |   2.426977   .8091682     3.00   0.003     .8404166    4.013538
Middle East & North Africa (excl..)  |   2.376267   .6863588     3.46   0.001     1.030503    3.722032
                      Middle income  |    .384085   .6333938     0.61   0.544    -.8578295    1.625999
                            Moldova  |   1.170432   .6259937     1.87   0.062    -.0569727    2.397837
                           Mongolia  |  -.4563486   .6782557    -0.67   0.501    -1.786225     .873528
                            Morocco  |   6.200481   .8508922     7.29   0.000     4.532111    7.868852
                         Mozambique  |  -6.789218    .657441   -10.33   0.000    -8.078283   -5.500154
                            Myanmar  |   .8850986   .7386469     1.20   0.231    -.5631888    2.333386
                            Namibia  |  -13.85184   .6686196   -20.72   0.000    -15.16282   -12.54085
                              Nepal  |   5.105299   .6228784     8.20   0.000     3.884002    6.326595
                        Netherlands  |  -.4249613   .6843248    -0.62   0.535    -1.766738    .9168152
                        New Zealand  |   1.347877   .6788628     1.99   0.047       .01681    2.678944
                          Nicaragua  |   5.922358   .7018597     8.44   0.000       4.5462    7.298516
                              Niger  |  -3.200655   .6125818    -5.22   0.000    -4.401763   -1.999547
                      North America  |  -3.345901   .7254278    -4.61   0.000     -4.76827   -1.923533
                    North Macedonia  |   4.715012   1.730962     2.72   0.006     1.321061    8.108963
                             Norway  |  -1.902091   .7108216    -2.68   0.007     -3.29582   -.5083609
                       OECD members  |  -.7897716   .6632726    -1.19   0.234     -2.09027    .5107273
                               Oman  |   .8551343   .7532989     1.14   0.256    -.6218819     2.33215
                 Other small states  |  -9.372006   .6733395   -13.92   0.000    -10.69224   -8.051769
                           Pakistan  |   1.459803   .6678894     2.19   0.029     .1502523    2.769354
                              Palau  |  -3.352118   1.738451    -1.93   0.054    -6.760752    .0565155
                             Panama  |   3.861797   .6862019     5.63   0.000      2.51634    5.207254
                   Papua New Guinea  |  -3.413428   1.298481    -2.63   0.009      -5.9594   -.8674557
                           Paraguay  |   3.376744    .677783     4.98   0.000     2.047794    4.705693
                               Peru  |   4.101397   .6451812     6.36   0.000     2.836371    5.366424
                        Philippines  |   3.263887   .6509657     5.01   0.000     1.987518    4.540255
                             Poland  |   1.600163   .6747092     2.37   0.018     .2772403    2.923086
                           Portugal  |   1.597718   .6690447     2.39   0.017     .2859017    2.909534
          Post-demographic dividend  |  -.9094344    .669458    -1.36   0.174    -2.222061    .4031923
           Pre-demographic dividend  |  -7.930719   .6325223   -12.54   0.000    -9.170925   -6.690513
                              Qatar  |   .6895713   .8130754     0.85   0.396    -.9046504    2.283793
                            Romania  |   1.096765   .6834312     1.60   0.109    -.2432597    2.436789
                 Russian Federation  |  -3.921136   .7018532    -5.59   0.000    -5.297281   -2.544991
                             Rwanda  |   .9432079   .6327934     1.49   0.136    -.2975295    2.183945
                              Samoa  |    2.13057   .6850716     3.11   0.002     .7873296    3.473811
              Sao Tome and Principe  |   1.459591   .6028623     2.42   0.016     .2775405    2.641641
                       Saudi Arabia  |  -1.495142    .750785    -1.99   0.047    -2.967229   -.0230547
                            Senegal  |  -1.067681   .6289193    -1.70   0.090    -2.300822    .1654605
                             Serbia  |   1.929987   .7047002     2.74   0.006     .5482602    3.311714
                         Seychelles  |  -1.643882   .7266038    -2.26   0.024    -3.068557    -.219208
                       Sierra Leone  |  -13.18455   .5762183   -22.88   0.000    -14.31436   -12.05475
                          Singapore  |    2.40594   .7275955     3.31   0.001     .9793215    3.832559
                    Slovak Republic  |  -.2309295   .6718182    -0.34   0.731    -1.548184    1.086325
                           Slovenia  |   1.542583   .6775368     2.28   0.023     .2141156     2.87105
                       Small states  |  -7.116628   .6778314   -10.50   0.000    -8.445673   -5.787583
                    Solomon Islands  |     3.5476   .7171704     4.95   0.000     2.141422    4.953778
                       South Africa  |  -14.08029   .6158506   -22.86   0.000    -15.28781   -12.87277
                         South Asia  |   2.308222   .6489611     3.56   0.000     1.035784     3.58066
            South Asia (IDA & IBRD)  |   2.308222   .6489611     3.56   0.000     1.035784     3.58066
                              Spain  |   3.306604   .6688569     4.94   0.000     1.995156    4.618052
                          Sri Lanka  |    7.70005   .7079557    10.88   0.000      6.31194    9.088161
                St. Kitts and Nevis  |  -2.470548   1.751561    -1.41   0.158    -5.904888    .9637916
                          St. Lucia  |   1.771773   .6840908     2.59   0.010     .4304557    3.113091
     St. Vincent and the Grenadines  |  -.6826851     .78059    -0.87   0.382    -2.213212    .8478416
                 Sub-Saharan Africa  |  -8.731209   .6184799   -14.12   0.000    -9.943882   -7.518537
Sub-Saharan Africa (IDA & IBRD c..)  |  -8.731209   .6184799   -14.12   0.000    -9.943882   -7.518537
Sub-Saharan Africa (excluding hi..)  |  -8.729551   .6184627   -14.11   0.000     -9.94219   -7.516912
                              Sudan  |  -2.543133   .7951713    -3.20   0.001     -4.10225   -.9840167
                           Suriname  |  -1.497807    .904515    -1.66   0.098    -3.271317    .2757032
                             Sweden  |   .0962109   .6939551     0.14   0.890    -1.264448     1.45687
                        Switzerland  |  -.2429036   .6902223    -0.35   0.725    -1.596244    1.110436
               Syrian Arab Republic  |   1.732162   .8026635     2.16   0.031     .1583554    3.305969
                         Tajikistan  |   5.771775   .6084909     9.49   0.000     4.578688    6.964861
                           Tanzania  |  -3.226014   .6314845    -5.11   0.000    -4.464185   -1.987843
                           Thailand  |   3.755613   .6724894     5.58   0.000     2.437043    5.074184
                        Timor-Leste  |   2.152738   .7105949     3.03   0.002     .7594529    3.546023
                               Togo  |  -4.402445   .6117614    -7.20   0.000    -5.601944   -3.202946
                              Tonga  |   1.538749   .8269921     1.86   0.063    -.0827598    3.160258
                Trinidad and Tobago  |  -3.206626    .728779    -4.40   0.000    -4.635565   -1.777687
                            Tunisia  |   4.447602   .6618807     6.72   0.000     3.149832    5.745371
                            Turkiye  |   1.352496   .8207635     1.65   0.099    -.2568001    2.961792
                       Turkmenistan  |  -4.466185   1.284431    -3.48   0.001    -6.984607   -1.947762
                             Uganda  |  -4.492761    .616562    -7.29   0.000    -5.701673   -3.283849
                            Ukraine  |   .8728985    .642335     1.36   0.174    -.3865474    2.132344
               United Arab Emirates  |  -1.219111   1.770371    -0.69   0.491    -4.690333     2.25211
                     United Kingdom  |  -.2957729   .6870469    -0.43   0.667    -1.642887    1.051341
                      United States  |  -4.240377   1.015272    -4.18   0.000    -6.231053   -2.249701
                Upper middle income  |   2.154531   .6449842     3.34   0.001     .8898907    3.419171
                            Uruguay  |   2.196165   .6720037     3.27   0.001     .8785473    3.513783
                         Uzbekistan  |   2.943899   .7518509     3.92   0.000     1.469722    4.418076
                            Vanuatu  |   1.424215    .751361     1.90   0.058    -.0490018    2.897431
                      Venezuela, RB  |  -.6462423   1.083731    -0.60   0.551    -2.771147    1.478662
                            Vietnam  |   7.200042   .7203535    10.00   0.000     5.787623    8.612461
                              World  |  -3.523352   .6179365    -5.70   0.000    -4.734959   -2.311745
                        Yemen, Rep.  |  -1.390615   1.088456    -1.28   0.201    -3.524784    .7435551
                             Zambia  |  -8.196616   .6380944   -12.85   0.000    -9.447747   -6.945485
                           Zimbabwe  |  -8.367671   .7455031   -11.22   0.000    -9.829402   -6.905941
                                     |
                               _cons |   36.17859   .6946126    52.08   0.000     34.81664    37.54053
------------------------------------------------------------------------------------------------------

. eststo ols4

. // In this model we see that the coeffcient of determination was boosted to 96.69% which is very good
>  as it is close to a hundred, meaning the model explains close to 100% of the total variability,also 
> we see that all the variables prior to the use of the categorical variable COUNTRY_I are now signific
> ant at the 5% significance level, every variable other than population growth have a positive impact 
> on life expectancy which goes in line with our intuition as compared to the previous models which hav
> e spending on health by government showing a negative coefficient which goes against our intuition. T
> he base for comparison in the COUNTRY_I categorical variable is Aruba so each country is being compar
> ed to Afghanistan in the regression .
. // The standard errors are very low and there are 3324 observations as in the previous models.
. 
. 
. 
. 
. 
. /*=================*/
. /* FIXED EFFECT    */
. /*=================*/
. 
. xtset COUNTRY_I YEAR

Panel variable: COUNTRY_I (strongly balanced)
 Time variable: YEAR, 1960 to 2021
         Delta: 1 unit

. 
. // My dataset is strongly balanced as each COUNTRY has data from 1960 uptill 2021 
. 
. foreach var in LIFEEXPECTANCYATBIRTHTOTALYEARS  LOG_GDPPERCAPITACURRENTUS CURRENTHEALTHEXPENDITUREOFG
> DP GOVERNMENTEXPENDITUREONEDUCATION POPULATIONGROWTHANNUAL{ 
  2.         bys  COUNTRY_I (YEAR): gen D_`var' = `var'[_n] - `var'[_n-1]. // DID NOT WORK 
  3. }
D_LIFEEXPECTANCYATBIRTHTOTALYEARS invalid varname
r(198);

end of do-file

r(198);

. do "/var/folders/dc/4chl20793rvf6j8szcwskp840000gn/T//SD20098.000000"

. xtreg LIFEEXPECTANCYATBIRTHTOTALYEARS  LOG_GDPPERCAPITACURRENTUS CURRENTHEALTHEXPENDITUREOFGDP GOVERN
> MENTEXPENDITUREONEDUCATION POPULATIONGROWTHANNUAL, fe

Fixed-effects (within) regression               Number of obs     =      3,324
Group variable: COUNTRY_I                       Number of groups  =        224

R-squared:                                      Obs per group:
     Within  = 0.5176                                         min =          1
     Between = 0.7008                                         avg =       14.8
     Overall = 0.6874                                         max =         20

                                                F(4,3096)         =     830.41
corr(u_i, Xb) = 0.2193                          Prob > F          =     0.0000

--------------------------------------------------------------------------------------------------
 LIFEEXPECTANCYATBIRTHTOTALYEARS | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
---------------------------------+----------------------------------------------------------------
       LOG_GDPPERCAPITACURRENTUS |   3.939137   .0724841    54.34   0.000     3.797016    4.081259
   CURRENTHEALTHEXPENDITUREOFGDP |   .1560083   .0365897     4.26   0.000     .0842657    .2277509
GOVERNMENTEXPENDITUREONEDUCATION |   .1904143   .0404678     4.71   0.000     .1110679    .2697608
          POPULATIONGROWTHANNUAL |   -.270983   .0557221    -4.86   0.000     -.380239    -.161727
                           _cons |   35.42494   .6099092    58.08   0.000     34.22907     36.6208
---------------------------------+----------------------------------------------------------------
                         sigma_u |  4.5574885
                         sigma_e |  1.6590163
                             rho |  .88299406   (fraction of variance due to u_i)
--------------------------------------------------------------------------------------------------
F test that all u_i=0: F(223, 3096) = 107.44                 Prob > F = 0.0000

. eststo fe

. 
. // The results are similar to that involving the use of the Country categorical variable
. 
. esttab ols ols2 ols3 ols4 fe using tryout.csv, replace
(output written to tryout.csv)

. 
end of do-file

. log close
      name:  <unnamed>
       log:  /Users/nyoumssiboss/Desktop/E_P/P1_LOG.log
  log type:  text
 closed on:  11 Nov 2022, 03:19:32
-------------------------------------------------------------------------------------------------------
